In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Pandas
DataFrame (Excel -> Table)
Series (Excel -> Column)

In [4]:
s1=pd.Series([1,2,3,4,5])
print(s1)
s2=pd.Series((1,2,3,4,5))
print(s2)
s3=pd.Series([1,2,3,4,5],index=['A','B','C','D','E'],name='aplha')
s3.index.name='beta'

s3

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64

beta
A    1
B    2
C    3
D    4
E    5
Name: aplha, dtype: int64

In [5]:
d1={
    'A':[1,2,3],
    'B':[3,2,1],
    'C':[5,6,7]
}
d1

{'A': [1, 2, 3], 'B': [3, 2, 1], 'C': [5, 6, 7]}

In [6]:
Data=[[1,'ali','urdu',12],
          [2,'khan','english',13],
          [3,'shahir','arabic',14],
          [4,'dildar','french',15]]
Data

[[1, 'ali', 'urdu', 12],
 [2, 'khan', 'english', 13],
 [3, 'shahir', 'arabic', 14],
 [4, 'dildar', 'french', 15]]

In [7]:
df1=pd.DataFrame(Data)
df1

   0       1        2   3
0  1     ali     urdu  12
1  2    khan  english  13
2  3  shahir   arabic  14
3  4  dildar   french  15

In [8]:
df1=pd.DataFrame(Data,columns=['ID','Name','course','Fee'],index=range(1,5))
df1

   ID    Name   course  Fee
1   1     ali     urdu   12
2   2    khan  english   13
3   3  shahir   arabic   14
4   4  dildar   french   15

# List of tupple

In [9]:
dta=((1,'ali','ai',1500),
     (2,'sher','iot',1200),
     (3,'khan','ai',1300),
     (4,'mir','cnc',1100))
dta

((1, 'ali', 'ai', 1500),
 (2, 'sher', 'iot', 1200),
 (3, 'khan', 'ai', 1300),
 (4, 'mir', 'cnc', 1100))

In [10]:
df_1=pd.DataFrame(dta)
df_1

   0     1    2     3
0  1   ali   ai  1500
1  2  sher  iot  1200
2  3  khan   ai  1300
3  4   mir  cnc  1100

In [11]:
df_1=pd.DataFrame(dta,columns=['id','name','course','fee'],index=range(19,23))
df_1

    id  name course   fee
19   1   ali     ai  1500
20   2  sher    iot  1200
21   3  khan     ai  1300
22   4   mir    cnc  1100

In [12]:
dic={
    'id':[1,2,3,4,5],
    'name':['mehr','tube','qureshi','nisar','wasim'],
    'course':['ai','cnc','ml','dl','it'],
    'fee':[1222,1123,11342,2124,2443]
}
dic

{'id': [1, 2, 3, 4, 5],
 'name': ['mehr', 'tube', 'qureshi', 'nisar', 'wasim'],
 'course': ['ai', 'cnc', 'ml', 'dl', 'it'],
 'fee': [1222, 1123, 11342, 2124, 2443]}

In [13]:
df_2=pd.DataFrame(dic,index=['i','ii','iii','iv','v'])
df_2

     id     name course    fee
i     1     mehr     ai   1222
ii    2     tube    cnc   1123
iii   3  qureshi     ml  11342
iv    4    nisar     dl   2124
v     5    wasim     it   2443

In [17]:
df1=pd.DataFrame(
    np.random.randint(1,100, size = (100,5)),
    columns=['a','b','c','d','e'])

df1.head(4)

    a   b   c   d   e
0  11  70   5  69  57
1  32  36  32  57  82
2  27  68  73  71  12
3   4  49  28  39  38

# Dictinary of series

In [18]:

d1 = {"A":pd.Series([1,2,3]),
     "B":pd.Series([3,3,5])}
pd.DataFrame(d1)

   A  B
0  1  3
1  2  3
2  3  5

# Get General Infromation from your DataFrame

In [83]:
dta_x={'id':[1,2,3,4,5],
     'name':['ali','sher',np.nan,'mir','wasim'],
     'course':['ai','iot','5g',np.nan,'cnc'],
     'fee':[1222,12323,1234,453,34532]}
df_x=pd.DataFrame(dta_x)
df_x

   id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532

In [84]:
#dataframe.info() #dataframe.describe() #dataframe.dtypes #dataframe.columns
#dataframe.index #dataframe.values #dataframe.isnull() #dataframe.isnull().sum() 
#dataframe.notnull() #dataframe.notnull().sum() #dataframe.head(n=5) #dataframe.tail() 
#dataframe.apply() # pass user define function

In [85]:
df_x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
id        5 non-null int64
name      4 non-null object
course    4 non-null object
fee       5 non-null int64
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [86]:
print(df_x.describe())

             id           fee
count  5.000000      5.000000
mean   3.000000   9952.800000
std    1.581139  14596.621722
min    1.000000    453.000000
25%    2.000000   1222.000000
50%    3.000000   1234.000000
75%    4.000000  12323.000000
max    5.000000  34532.000000

In [87]:
df_x.columns

Index(['id', 'name', 'course', 'fee'], dtype='object')

In [88]:
df_x.isnull()

      id   name  course    fee
0  False  False   False  False
1  False  False   False  False
2  False   True   False  False
3  False  False    True  False
4  False  False   False  False

In [89]:
df_x.index

RangeIndex(start=0, stop=5, step=1)

In [90]:
df_x.values

array([[1, 'ali', 'ai', 1222],
       [2, 'sher', 'iot', 12323],
       [3, nan, '5g', 1234],
       [4, 'mir', nan, 453],
       [5, 'wasim', 'cnc', 34532]], dtype=object)

In [91]:
df_x.isnull().sum()

id        0
name      1
course    1
fee       0
dtype: int64

In [92]:
df_x.notnull

<bound method DataFrame.notnull of    id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532>

In [93]:
df_x.apply

<bound method DataFrame.apply of    id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532>

In [94]:
df_x.tail(2)

   id   name course    fee
3   4    mir    NaN    453
4   5  wasim    cnc  34532

In [95]:
df_x[df_x.id<=2.5]

   id  name course    fee
0   1   ali     ai   1222
1   2  sher    iot  12323

In [96]:
#add a new column
df_x['updated fee']=0
print(df_x)
df_x['updated fee']=333445
df_x

   id   name course    fee  updated fee
0   1    ali     ai   1222            0
1   2   sher    iot  12323            0
2   3    NaN     5g   1234            0
3   4    mir    NaN    453            0
4   5  wasim    cnc  34532            0

   id   name course    fee  updated fee
0   1    ali     ai   1222       333445
1   2   sher    iot  12323       333445
2   3    NaN     5g   1234       333445
3   4    mir    NaN    453       333445
4   5  wasim    cnc  34532       333445

In [97]:
df_x.Timing=40
df_x

   id   name course    fee  updated fee
0   1    ali     ai   1222       333445
1   2   sher    iot  12323       333445
2   3    NaN     5g   1234       333445
3   4    mir    NaN    453       333445
4   5  wasim    cnc  34532       333445

In [98]:
print(df_x.name.map)
print(df_x.course.map)

<bound method Series.map of 0      ali
1     sher
2      NaN
3      mir
4    wasim
Name: name, dtype: object>
<bound method Series.map of 0     ai
1    iot
2     5g
3    NaN
4    cnc
Name: course, dtype: object>

In [99]:
dtf={}
for i , v in enumerate(df_x.course.unique()):
    dtf[v]=i
dtf

{'ai': 0, 'iot': 1, '5g': 2, nan: 3, 'cnc': 4}

In [100]:
df_x.name.value_counts()

sher     1
ali      1
wasim    1
mir      1
Name: name, dtype: int64

In [101]:
df_x.fee.sum()

49764

# APPLY FUNCTION

In [102]:
df_x

   id   name course    fee  updated fee
0   1    ali     ai   1222       333445
1   2   sher    iot  12323       333445
2   3    NaN     5g   1234       333445
3   4    mir    NaN    453       333445
4   5  wasim    cnc  34532       333445

In [103]:
def f1(x):
    if x=='ai':
        return 2123
    elif x=='iot':
        return 33442
    elif x=='5g':
        return 883
    elif x=='NaN':
        return 0
    elif x=='cnc':
        return 34344
    else:
        return 'none'
df_x.course.apply(f1)

0     2123
1    33442
2      883
3     none
4    34344
Name: course, dtype: object

In [107]:
df_x['updated course']=df_x.course.apply(f1)
df_x

   id   name course    fee  updated fee updated course
0   1    ali     ai   1222       333445           2123
1   2   sher    iot  12323       333445          33442
2   3    NaN     5g   1234       333445            883
3   4    mir    NaN    453       333445           none
4   5  wasim    cnc  34532       333445          34344

In [132]:
df_y=pd.DataFrame(np.random.randint(1,30,size=(4,5)),columns=['A','B','C','D','E'])
df_y

    A   B   C   D   E
0  21   5  19  17  25
1   9   5  18   2  19
2   5  29  13  24  23
3  16  20  29   7  27

In [137]:
df_z=pd.concat([df_y,df_x], axis=0)
df_z

/home/zulkifel/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

,A,B,C,D,E,course,fee,id,name,updated course,updated fee
0,21.0,5.0,19.0,17.0,25.0,NaN,NaN,NaN,NaN,NaN,NaN
1,9.0,5.0,18.0,2.0,19.0,NaN,NaN,NaN,NaN,NaN,NaN
2,5.0,29.0,13.0,24.0,23.0,NaN,NaN,NaN,NaN,NaN,NaN
3,16.0,20.0,29.0,7.0,27.0,NaN,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,ai,1222.0,1.0,ali,2123,333445.0
1,NaN,NaN,NaN,NaN,NaN,iot,12323.0,2.0,sher,33442,333445.0
2,NaN,NaN,NaN,NaN,NaN,5g,1234.0,3.0,NaN,883,333445.0
3,NaN,NaN,NaN,NaN,NaN,NaN,453.0,4.0,mir,none,333445.0
4,NaN,NaN,NaN,NaN,NaN,cnc,34532.0,5.0,wasim,34344,333445.0

In [135]:
df_z=pd.concat([df_y,df_x], axis=1)
df_z

,A,B,C,D,E,id,name,course,fee,updated fee,updated course
0,21.0,5.0,19.0,17.0,25.0,1,ali,ai,1222,333445,2123
1,9.0,5.0,18.0,2.0,19.0,2,sher,iot,12323,333445,33442
2,5.0,29.0,13.0,24.0,23.0,3,NaN,5g,1234,333445,883
3,16.0,20.0,29.0,7.0,27.0,4,mir,NaN,453,333445,none
4,NaN,NaN,NaN,NaN,NaN,5,wasim,cnc,34532,333445,34344

In [149]:
df_z['total']=df_z.A+ df_z.B+ df_z.C+ df_z.C+ df_z.E
df_z

,A,B,C,D,E,course,fee,id,name,updated course,updated fee,total
0,21.0,5.0,19.0,17.0,25.0,NaN,NaN,NaN,NaN,NaN,NaN,89.0
1,9.0,5.0,18.0,2.0,19.0,NaN,NaN,NaN,NaN,NaN,NaN,69.0
2,5.0,29.0,13.0,24.0,23.0,NaN,NaN,NaN,NaN,NaN,NaN,83.0
3,16.0,20.0,29.0,7.0,27.0,NaN,NaN,NaN,NaN,NaN,NaN,121.0
0,NaN,NaN,NaN,NaN,NaN,ai,1222.0,1.0,ali,2123,333445.0,NaN
1,NaN,NaN,NaN,NaN,NaN,iot,12323.0,2.0,sher,33442,333445.0,NaN
2,NaN,NaN,NaN,NaN,NaN,5g,1234.0,3.0,NaN,883,333445.0,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,453.0,4.0,mir,none,333445.0,NaN
4,NaN,NaN,NaN,NaN,NaN,cnc,34532.0,5.0,wasim,34344,333445.0,NaN

In [154]:
df_z ['percentage']=(df_z.A+df_z.B+df_z.C+df_z.D+df_z.E)/500*100
def grade(y):
    if y>=80:
        return 'A'
    elif y>=70:
        return 'B'
    elif y>=60:
        return 'C'
    elif y>=50:
        return 'D'
    else:
        return 'Fail'
df_z['Grade']=df_z.percentage.apply(grade)
df_z

,A,B,C,D,E,course,fee,id,name,updated course,updated fee,total,percentage,Grade
0,21.0,5.0,19.0,17.0,25.0,NaN,NaN,NaN,NaN,NaN,NaN,89.0,17.4,Fail
1,9.0,5.0,18.0,2.0,19.0,NaN,NaN,NaN,NaN,NaN,NaN,69.0,10.6,Fail
2,5.0,29.0,13.0,24.0,23.0,NaN,NaN,NaN,NaN,NaN,NaN,83.0,18.8,Fail
3,16.0,20.0,29.0,7.0,27.0,NaN,NaN,NaN,NaN,NaN,NaN,121.0,19.8,Fail
0,NaN,NaN,NaN,NaN,NaN,ai,1222.0,1.0,ali,2123,333445.0,NaN,NaN,Fail
1,NaN,NaN,NaN,NaN,NaN,iot,12323.0,2.0,sher,33442,333445.0,NaN,NaN,Fail
2,NaN,NaN,NaN,NaN,NaN,5g,1234.0,3.0,NaN,883,333445.0,NaN,NaN,Fail
3,NaN,NaN,NaN,NaN,NaN,NaN,453.0,4.0,mir,none,333445.0,NaN,NaN,Fail
4,NaN,NaN,NaN,NaN,NaN,cnc,34532.0,5.0,wasim,34344,333445.0,NaN,NaN,Fail